{
  "welcome": "Hi,I am a",
  "about": "About",
  "projects": "Projects",
  "Hosted": "Hosted",
  "Skills": "Skills",
  "contact": "Contact",
  "GitHub": "GitHub",
  "Linkedin": "Linkedin",
  "Resume": "Check my Resume",
  "devlp": "a Software Engineer",
  "descdev1": "Computer engineering student at",
  "esprit":"Esprit Private School of Engineering and Technology",
  "descdev2": "from 2020 to 2025. Passionate about web and mobile development, I am looking for a final year project starting in mid-December 2024.",
  "aboutDesc": "Currently seeking a final year project to complete my Computer Science Engineering degree. I am a dedicated software developer who enjoys building useful tools and bringing ideas to life. I have gained hands-on experience through numerous group projects and internships, which have sharpened my development skills. I am particularly interested in full-stack web applications but am versatile and open to various types of projects.",
  "aboutme": "overview",
  "3dbutton": "Discover me in a 3D world",
  "hosted":"Hosted",
  "hosteddesc":"Hosted Projects",
  "Intership": "Internships",
  "intershipdesc": "Some Academic & Internships Web Projects",
  "Intershipname1": "Full Stack Web Internship (Plug & Tel)",
  "IntershipDate1": "August 2024-September 2024",
"t1": "Led a project to migrate critical call data from MySQL to Elasticsearch, enhancing query performance with the Spring framework.",
"t2": "Developed interactive visualizations with React.js to facilitate dynamic and intuitive data analysis.",
"t3": "Refined Elasticsearch index structures for improved query speed and storage efficiency.",
"t4": "Addressed performance issues and significantly reduced response times for statistical queries.",
"t5": "Implemented dashboards and monitoring tools to track and optimize query performance and data insights.",
  "t6": "link:",
  "collab": "An online platform that allows independent professionals to offer their services and clients to search for and hire freelancers in various fields.",


  "Intershipname2": "Electrigo (Symfony)",
  "IntershipDate2": "September 2023 - May 2023",
  "t21": "An online Web,Desktop and Mobile platform dedicated to the rental of electric bikes and cars, offering a practical and sustainable solution for urban mobility.",
  "t22": "Allows users to search, book, and rent electric bikes and cars through the platform, with customizable options such as rental duration, vehicle model, and pickup location.",
  "t23": "Provides a personal space for users to manage their bookings, view rental history, and update their personal information.",
  "t24": "Integration of AI-based chatbots to assist users with their searches, answer their questions, and provide real-time customer support.",

  "Intershipname3": "CollubHub (React js + Node js)",
  "IntershipDate3": "January 2024 - May 2024",
  "t31": "An online and  platform enabling freelancers to offer their services and clients to search for and hire freelancers across various fields",
  "t32": "Set up recommendation systems using machine learning algorithms to suggest freelancers or projects based on user preferences and behavior",
  "t33": "Developed tools for the automatic evaluation of freelancers' skills based on their profiles and previous work, providing accurate and relevant assessments.",
  "t34": "Integrated AI-powered chatbots to assist users in their searches, answer their questions, and provide real-time customer support.",


  "Intershipname4": "Human and Social Training Internship (Wifak Bank 2022)",
  "IntershipDate4": "June 2022 - August 2022",
  "t41": "Desktop application with C# designed to manage and track deadlines, facilitating efficient monitoring and verification of employee payments",
  "t42": "Designed a user-friendly interface using Windows Forms, allowing employees to easily access deadline information and perform verifications efficiently",
  "t43": "Optimized the structure of Elasticsearch indices to ensure fast queries and efficient storage.",

  "Academic & Self-Learned Skills": "Academic & Self-Learned Skills",
  "Programming Languages": "Programming Languages",
  "Databases": "Databases",
  "DevOps Tools": "DevOps Tools",
  "Adobe": "Adobe",
  "Other": "Other",

  "se":"Software Engineer",
  "fe":"Full stack developer"
}